Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "7owe3f" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.render_video must be replaced
-/+ resource "aws_ecs_task_definition" "render_video" {
      ~ arn                      = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  ~ image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:15e6de424553b1a8b8c0f63e15b8ba830f29abc51b2d526bd9941c744285da59" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:6c5ba74836f1a613884b69d60a59d8f3ebb51684923ae84b94282b4a10d19ec9"
                    name             = "render_video"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "render_video" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "efs" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-0e0f22150227b252a" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-076e0e4723ceab689" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "efs"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0e0f22150227b252a"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-076e0e4723ceab689"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role_policy.step_functions_ecs will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_ecs" {
        id          = "sharedservices_step_functions_role:terraform-20250506171657143600000003"
        name        = "terraform-20250506171657143600000003"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:4"
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                          - "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                          - "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogDelivery",
                          - "logs:GetLogDelivery",
                          - "logs:UpdateLogDelivery",
                          - "logs:DeleteLogDelivery",
                          - "logs:ListLogDeliveries",
                          - "logs:PutResourcePolicy",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:DescribeRule",
                          - "events:RemoveTargets",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:4"
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                          - "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.render_video will be updated in-place
~ resource "aws_lambda_function" "render_video" {
        id                             = "render_video"
      ~ image_uri                      = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:15e6de424553b1a8b8c0f63e15b8ba830f29abc51b2d526bd9941c744285da59" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:6c5ba74836f1a613884b69d60a59d8f3ebb51684923ae84b94282b4a10d19ec9"
      ~ last_modified                  = "2025-05-06T19:05:10.000+0000" -> (known after apply)
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.manual_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "manual_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "State machine for the manual post workflow"
              - StartAt = "GetLogo"
              - States  = {
                  - DeleteLogo  = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:delete_logo"
                      - ResultPath = "$.deleteLogoResult"
                      - Type       = "Task"
                    }
                  - GetLogo     = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:get_logo"
                      - ResultPath = "$.logoResult"
                      - Type       = "Task"
                    }
                  - NotifyUser  = {
                      - End        = true
                      - InputPath  = "$"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - RenderVideo = {
                      - Next       = "DeleteLogo"
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:us-east-2:825765422855:cluster/sharedservices-render-cluster"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - AssignPublicIp = "ENABLED"
                                  - SecurityGroups = [
                                      - "sg-00b24671fa06607c7",
                                    ]
                                  - Subnets        = [
                                      - "subnet-0bbe8a2b2335e4038",
                                      - "subnet-0b4e467b5cedc1cd3",
                                    ]
                                }
                            }
                          - Overrides            = {
                              - ContainerOverrides = [
                                  - {
                                      - Environment = [
                                          - {
                                              - Name      = "EVENT_JSON"
                                              - "Value.$" = "States.JsonToString($)"
                                            },
                                          - {
                                              - Name      = "TASK_TOKEN"
                                              - "Value.$" = "$$.Task.Token"
                                            },
                                        ]
                                      - Name        = "render_video"
                                    },
                                ]
                            }
                          - TaskDefinition       = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:4"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.waitForTaskToken"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow"
        name                      = "manual_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 5 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```